src/randomMatrix/templateCases/cavity/cavity_base/constant/obsLocations
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      obsLocations;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

(
(1.250000000000000069e-02 1.250000000000000069e-02 5.000019999999999985e-03)
(1.249989999999999955e-02 3.749999999999999861e-02 5.000039999999999867e-03)
(1.250000000000000069e-02 6.250000000000000000e-02 5.000039999999999867e-03)
(1.250000000000000069e-02 8.749999999999999445e-02 5.000029999999999926e-03)
);