src/randomMatrix/templateCases/cavity/cavity_base/0/Tau
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      Tau;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<symmTensor> 
16
(
(8.504e-05 1.81483e-05 0 8.11539e-05 0 9.07031e-05)
(0.000134741 1.6871e-05 0 0.000125613 0 0.000139001)
(0.000204301 1.84848e-05 0 0.000226593 0 0.000219371)
(0.000164914 3.91506e-05 0 0.000124519 0 0.000141444)
(0.000385855 -1.04693e-05 0 0.00017835 0 0.000268468)
(0.000646473 9.70274e-05 0 0.000521541 0 0.000552206)
(0.000800031 0.000172875 0 0.000950956 0 0.000782287)
(0.000491441 8.8567e-05 0 0.00117118 0 0.000808711)
(0.000415822 -9.4709e-05 0 0.000253568 0 0.000312146)
(0.00115176 -8.6712e-05 0 0.00076202 0 0.000921483)
(0.00184153 0.000152157 0 0.00136808 0 0.00171453)
(0.00167546 -0.00156227 0 0.00242615 0 0.00242024)
(0.000421371 -0.00400217 0 0.00106166 0 0.000786342)
(0.0020477 -0.00579317 0 0.00211762 0 0.00183337)
(0.00153338 -0.00817957 0 0.00355946 0 0.00345367)
(0.00605754 -0.00700322 0 0.0029245 0 0.00361225)
)
;

boundaryField
{
    movingWall
    {
        type            calculated;
        value           nonuniform List<symmTensor> 4((0.000757109 -0.000618847 0 0.00083148 0 0.000786342) (0.00185537 -0.00112082 0 0.0019357 0 0.00183337) (0.00323799 -0.00182395 0 0.0036462 0 0.00345367) (0.00388816 -0.00126018 0 0.00356438 0 0.00361225));
    }
    fixedWalls
    {
        type            calculated;
        value           nonuniform List<symmTensor> 
12
(
(9.07031e-05 0 0 9.07031e-05 0 9.07031e-05)
(0.00027305 -1.07911e-06 0 0.000266085 0 0.000268468)
(0.000317342 -7.77714e-06 0 0.000310022 0 0.000312146)
(0.000764176 -0.000330951 0 0.000808395 0 0.000786342)
(0.000141444 0 0 0.000141444 0 0.000141444)
(0.000761511 2.26816e-06 0 0.000838095 0 0.000808711)
(0.00227728 -0.000230165 0 0.00242087 0 0.00242024)
(0.00478475 -0.000832875 0 0.00353465 0 0.00361225)
(9.07031e-05 0 0 9.07031e-05 0 9.07031e-05)
(0.000139001 0 0 0.000139001 0 0.000139001)
(0.000219192 -3.60851e-07 0 0.000219241 0 0.000219371)
(0.000141444 0 0 0.000141444 0 0.000141444)
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
