src/randomMatrix/templateCases/cavity/cavity_base/0/deltaXi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      deltaXi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
16
(
0.000131537
0.000208794
0.000327069
0.000209949
0.000393541
0.000823981
0.00116652
0.00116499
0.000478072
0.00141022
0.00259132
0.00363534
0.00119308
0.0028159
0.00528108
0.00548508
)
;

boundaryField
{
    movingWall
    {
        type            kqRWallFunction;
        value           nonuniform List<scalar> 4(0.00119308 0.0028159 0.00528108 0.00548508);
    }
    fixedWalls
    {
        type            kqRWallFunction;
        value           nonuniform List<scalar> 
12
(
0.000131537
0.000393541
0.000478072
0.00119308
0.000209949
0.00116499
0.00363534
0.00548508
0.000131537
0.000208794
0.000327069
0.000209949
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
